[Killed] BlockStatement
app/day-or-night.js:2:26
 
-function partOfDay(hour) {
-
-    if (hour >= 7 && hour <= 18)
-        return 'Daylight'
-
-    return 'Night'
-}
+function partOfDay(hour) {}
 
 module.exports = {
killedBy: When is it daylight? is daylight between 7am and 6pm (inclusive)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Daylight"
Received: undefined

[Killed] EqualityOperator
app/day-or-night.js:4:22
 
 function partOfDay(hour) {
 
-    if (hour >= 7 && hour <= 18)
+    if (hour >= 7 && hour > 18)
         return 'Daylight'
 
killedBy: When is it daylight? is daylight between 7am and 6pm (inclusive)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Daylight"
Received: "Night"

[Killed] ConditionalExpression
app/day-or-night.js:4:9
 
 function partOfDay(hour) {
 
-    if (hour >= 7 && hour <= 18)
+    if (true && hour <= 18)
         return 'Daylight'
 
killedBy: When is it daylight? is night after 7pm and before 6am
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Night"
Received: "Daylight"

[Killed] StringLiteral
app/day-or-night.js:7:12
     if (hour >= 7 && hour <= 18)
         return 'Daylight'
 
-    return 'Night'
+    return ""
 }
 
killedBy: When is it daylight? is night after 7pm and before 6am
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Night"
Received: ""
